tests/mhdThermoInterFoamTest_2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (melt air);

melt
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-3;
    rho             [1 -3 0 0 0 0 0] 4506;
    cp              [0 2 -2 -1 0 0 0] 790;
    Pr              [0 0 0 0 0 0 0] 0.015;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-02;
    rho             [1 -3 0 0 0 0 0] 1.275;
    cp              [0 2 -2 -1 0 0 0] 1500;
    Pr              [0 0 0 0 0 0 0] 0.68;
}

sigma           [1 0 -2 0 0 0 0] 1.557;
elcond_ref       [0 0 0 0 0 0 0] 6.25e5;


// ************************************************************************* //
